=================================================
family: closed, nullary
=================================================

type family A where
  A = A

---

(module
 (type_family
  (tyfam_head (type))
  (where)
  (tyfam_eq
   (tyfam_pat (type))
   (equals)
   (type_name (type)))))

=================================================
family: closed, tyvars
=================================================

type family A a b c where
  A a b c = b c

---

(module
 (type_family
  (tyfam_head name: (type) (tyvar) (tyvar) (tyvar))
  (where)
  (tyfam_eq
   (tyfam_pat name: (type) (type_name (tyvar)) (type_name (tyvar)) (type_name (tyvar)))
   (equals)
   (type_apply (type_name (tyvar)) (type_name (tyvar))))))

=================================================
family: closed, pattern matching
=================================================

type family A a b c where
  A (Maybe a) [c] = a (Maybe c)

---

(module
 (type_family
  (tyfam_head (type) (tyvar) (tyvar) (tyvar))
  (where)
  (tyfam_eq
   (tyfam_pat
    (type)
    (type_parens (type_apply (type_name (type)) (type_name (tyvar))))
    (list_type (type_name (tyvar))))
   (equals)
   (type_apply (type_name (tyvar)) (type_parens (type_apply (type_name (type)) (type_name (tyvar))))))))

=================================================
family: closed, signature
=================================================

type family A a :: (k -> *) -> 'Just k where
  A a = a

---

(module
 (type_family
  (tyfam_head (type) (tyvar))
  (tyfam_sig
   (annotation)
   (fun
    (type_parens (fun (type_name (tyvar)) (star)))
    (type_apply (type_name (promoted (type))) (type_name (tyvar)))))
(where)
  (tyfam_eq
   (tyfam_pat (type) (type_name (tyvar)))
   (equals)
   (type_name (tyvar)))))

=================================================
family: closed, tyvar kind
=================================================

type family A (a :: ([k] -> *) -> k) where
  A a = a

---

(module
 (type_family
  (tyfam_head
   (type)
   (annotated_tyvar
    (tyvar)
    (annotation)
    (fun
     (type_parens (fun (list_type (type_name (tyvar))) (star)))
     (type_name (tyvar)))))
  (where)
  (tyfam_eq (tyfam_pat (type) (type_name (tyvar))) (equals) (type_name (tyvar)))))

=================================================
family: open
=================================================

type family A (a :: a) :: *
type instance A [A] = A
type instance A (A A) = A

---

(module
 (type_family
  (tyfam_head
   (type)
   (annotated_tyvar (tyvar) (annotation) (type_name (tyvar))))
  (tyfam_sig
   (annotation)
   (star)))
 (type_instance
  (type_name (type))
  (list_type (type_name (type)))
  (equals)
  (type_name (type)))
 (type_instance
  (type_name (type))
  (type_parens
   (type_apply
    (type_name (type))
    (type_name (type))))
  (equals)
  (type_name (type))))

=================================================
family: data family
=================================================

data family A a (a :: [a]) :: Type -> *

---

(module
 (data_family
  (type)
  (tyvar)
  (annotated_tyvar (tyvar) (annotation) (list_type (type_name (tyvar))))
  (annotation)
  (fun (type_name (type)) (star))))

=================================================
family: data instance adt
=================================================

data instance âˆ€ a . A a A =
  A a A a
  |
  A { a :: A }

---

(module
 (data_instance
  (forall (tyvar) (forall_dot))
  (type_apply
   (type_name (type))
   (type_name (tyvar))
   (type_name (type)))
  (equals)
  (constrs
   (constr (constr_id (constructor)) (type_name (tyvar)) (type_name (type)) (type_name (tyvar)))
   (bar)
   (constr_record
    (constr_id (constructor))
    (record_fields (field (field_id (variable)) (annotation) (type_name (type))))))))

=================================================
family: data instance gadt
=================================================

data instance A a where
  A :: A -> A a
  deriving (A, A)

---

(module
 (data_instance
  (type_apply
   (type_name (type))
   (type_name (tyvar)))
  (where)
  (gadt_constr
   (constructor)
   (annotation)
   (fun (type_name (type)) (type_apply (type_name (type)) (type_name (tyvar)))))
  (deriving (type) (comma) (type))))

=================================================
family: data instance newtype
=================================================

newtype instance A a a = A a deriving A

---

(module
 (data_instance
  (type_apply
   (type_name (type))
   (type_name (tyvar))
   (type_name (tyvar)))
  (equals)
  (constr_newtype (constr_id (constructor)) (type_name (tyvar)))
  (deriving (type))))
