=========================================
gendecl: basic
=========================================

a :: a -> A -> A a

---

(module
 (decl_sig
  name: (varid)
  (annotation)
  type: (fun
   (type_name (tyvar))
   (fun
    (type_name (type))
    (type_apply (type_name (type)) (type_name (tyvar)))))))

=========================================
gendecl: forall
=========================================

a :: forall a (a :: * -> Type) . (∀ a . a -> a) -> A a

---

(module
 (decl_sig
  (varid)
  (annotation)
  (forall
   (quantifiers
    (tyvar)
    (annotated_tyvar (tyvar) (annotation) (fun (star) (type_name (type)))))
   (forall_dot)
   (fun
    (type_parens
     (forall
      (quantifiers (tyvar))
      (forall_dot)
      (fun (type_name (tyvar)) (type_name (tyvar)))))
    (type_apply (type_name (type)) (type_name (tyvar)))))))

=========================================
gendecl: multi context, multi line
=========================================
a ::
  A a a =>
  (A a, A a) =>
  (A => a a) ->
  A a ->
  a

---

(module
 (decl_sig
  (varid)
  (annotation)
  (context
   (constraint (class_name (type)) (type_name (tyvar)) (type_name (tyvar)))
   (carrow)
   (context
    (constraint (class_name (type)) (type_name (tyvar)))
    (comma)
    (constraint (class_name (type)) (type_name (tyvar)))
    (carrow)
    (fun
     (type_parens
      (context (constraint (class_name (type)))
      (carrow)
      (type_apply (type_name (tyvar)) (type_name (tyvar)))))
     (fun (type_apply (type_name (type)) (type_name (tyvar))) (type_name (tyvar))))))))

=========================================
gendecl: multi context, single line
=========================================

a :: A a a => (A a, A a) => a

---

(module
 (decl_sig
  (varid)
  (annotation)
  (context
   (constraint (class_name (type)) (type_name (tyvar)) (type_name (tyvar)))
   (carrow)
   (context
    (constraint (class_name (type)) (type_name (tyvar)))
    (comma)
    (constraint (class_name (type)) (type_name (tyvar)))
    (carrow)
    (type_name (tyvar))))))

=========================================
gendecl: varsym context
=========================================

a :: a ++ a => a

---

(module
 (decl_sig
  name: (varid)
  (annotation)
  type: (context
   (constraint (type_infix left: (type_name (tyvar)) op: (tyconop (type_operator)) right: (type_name (tyvar))))
   (carrow)
   (type_name (tyvar)))))

=================================================
gendecl: implicit
=================================================

sort :: (?aaa :: a -> a -> a) => [a] -> [a]

---

(module
 (decl_sig
  (varid)
  (annotation)
  (context
   (implicit_param
    (implicit_parid)
    (annotation)
    (fun (type_name (tyvar)) (fun (type_name (tyvar)) (type_name (tyvar)))))
   (carrow)
   (fun
    (list_type (type_name (tyvar)))
    (list_type (type_name (tyvar)))))))


=========================================
gendecl: multi method varsym
=========================================

(<), (<=), (>=), (>) :: a

---

(module
 (decl_sig
  (varsym)
  (comma)
  (varsym)
  (comma)
  (varsym)
  (comma)
  (varsym)
  (annotation)
  (type_name (tyvar))))


=========================================
gendecl: alternating forall/context/_arrow
=========================================

a :: A a => ∀ a . a ++ a => a -> ∀ a . a -> A => A => A a

---

(module
 (decl_sig
  name: (varid)
  (annotation)
  type: (context
   (constraint class: (class_name (type)) (type_name (tyvar)))
   (carrow)
   (forall
    (quantifiers (tyvar))
    (forall_dot)
    (context
     (constraint (type_infix left: (type_name (tyvar)) op: (tyconop (type_operator)) right: (type_name (tyvar))))
     (carrow)
     (fun
      (type_name (tyvar))
      (forall
       (quantifiers (tyvar))
       (forall_dot)
       (fun
        (type_name (tyvar))
        (context
         (constraint class: (class_name (type)))
         (carrow)
         (context
          (constraint class: (class_name (type)))
          (carrow)
          (type_apply (type_name (type)) (type_name (tyvar)))))))))))))

=================================================
gendecl: parenthesized varsym fun
=================================================

(<>) = a

---

(module (decl_fun (funvar (varsym)) (funrhs (equals) (exp_name (varid)))))

=================================================
gendecl: HKT annotation
=================================================

a :: (a :: (* -> *) -> *) -> a

---

(module
 (decl_sig
  (varid)
  (annotation)
  (fun
   (type_name
    (annotated_tyvar
     (tyvar)
     (annotation)
     (fun
      (type_parens (fun (star) (star)))
      (star))))
   (type_name (tyvar)))))
