=========================================
import: single-segment module plain
=========================================

module A where

import A

---

(module (modid (constructor)) (where) (import (modid (constructor))))

=========================================
import: empty single-segment module
=========================================

import A ()

---

(module (import (modid (constructor)) (import_list)))

=========================================
import: single-segment module with alias
=========================================

import A as A

---

(module (import (modid (constructor)) (modid (constructor))))

=========================================
import: multi-segment module
=========================================

import A.A

---

(module (import (qmodid (modid (constructor)) (modid (constructor)))))

=========================================
import: var only
=========================================

import Aaa.A (aa)

---

(module (import (qmodid (modid (constructor)) (modid (constructor))) (import_list (import_item (varid)))))

=========================================
import: con only
=========================================

import Aaa.A (A)

---

(module (import (qmodid (modid (constructor)) (modid (constructor))) (import_list (import_item (constructor)))))

=========================================
import: con with constructor
=========================================

import Aaa.A (A(A))

---

(module
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (import_list (import_item (constructor) (import_con_names (constructor))))))

=========================================
import: con with var
=========================================

import Aaa.A (A(aa))

---

(module
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (import_list (import_item (constructor) (import_con_names (varid))))))

=========================================
import: con with symbolic var
=========================================

import Aaa.A (A((<>)))

---

(module
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (import_list (import_item (constructor) (import_con_names (varsym))))))

=========================================
import: con dotdot
=========================================

import Aaa.A (A(..))

---

(module
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (import_list (import_item (constructor) (import_con_names (all_names))))))

=========================================
import: qualified basic
=========================================

import qualified Aaa.A
import qualified A ()
import qualified Aaa.A (a)
import Aaa.A qualified (a)
import qualified Aaa.A hiding (A, a)

---

(module
 (import (qmodid (modid (constructor)) (modid (constructor))))
 (import (modid (constructor)) (import_list))
 (import (qmodid (modid (constructor)) (modid (constructor))) (import_list (import_item (varid))))
 (import (qmodid (modid (constructor)) (modid (constructor))) (import_list (import_item (varid))))
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (import_list (import_item (constructor)) (comma) (import_item (varid)))))

=========================================
import: qualified as
=========================================

module A where

import qualified Aaa.A as A
import qualified Aaa.A as A (A(A, a), aa)
import qualified A as A ()
import qualified Aaa.A as A
import qualified Aaa.A as Aaa.A
import qualified Aaa.A as A hiding (a)

---

(module
 (modid (constructor))
 (where)
 (import (qmodid (modid (constructor)) (modid (constructor))) (modid (constructor)))
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (modid (constructor))
  (import_list (import_item (constructor) (import_con_names (constructor) (comma) (varid))) (comma) (import_item (varid))))
 (import (modid (constructor)) (modid (constructor)) (import_list))
 (import (qmodid (modid (constructor)) (modid (constructor))) (modid (constructor)))
 (import (qmodid (modid (constructor)) (modid (constructor))) (qmodid (modid (constructor)) (modid (constructor))))
 (import (qmodid (modid (constructor)) (modid (constructor))) (modid (constructor)) (import_list (import_item (varid)))))

=========================================
import: prim
=========================================

import Aaa.Aa (Aa#, aa#)

---

(module
 (import
  (qmodid (modid (constructor)) (modid (constructor)))
  (import_list (import_item (constructor)) (comma) (import_item (varid)))))

=========================================
import: package
=========================================

import "a" Aaa.Aa
import qualified "a" Aaa.Aa as Aa (Aa(a))

---

(module
 (import (import_package) (qmodid (modid (constructor)) (modid (constructor))))
 (import
  (import_package)
  (qmodid (modid (constructor)) (modid (constructor)))
  (modid (constructor))
  (import_list (import_item (constructor) (import_con_names (varid))))))

=================================================
import: consym
=================================================

import A ((:<|>)((:<|>)))

---

(module (import (modid (constructor)) (import_list (import_item (consym) (import_con_names (consym))))))

=================================================
import: varsym
=================================================

import A ((<=<))

---

(module (import (modid (constructor)) (import_list (import_item (varsym)))))

=================================================
import: pattern/type
=================================================

import A (pattern A, type A)

---

(module
 (import
  (modid (constructor))
  (import_list
   (import_item (namespace) (constructor))
   (comma)
   (import_item (namespace) (constructor)))))
