=================================================
pat: basic
=================================================

a a (a:a : as) (a, a, (a, [a])) = a

---

(module
 (decl_fun
  (funvar
   (variable)
   (pat_name (variable))
   (pat_parens
    (pat_infix
     (pat_name (variable))
     (consym)
     (pat_infix (pat_name (variable)) (consym) (pat_name (variable)))))
   (pat_tuple
    (pat_name (variable))
    (comma)
    (pat_name (variable))
    (comma)
    (pat_tuple (pat_name (variable)) (comma) (pat_list (pat_name (variable))))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: con
=================================================

a A = a
a (A a) = a

---

(module
 (decl_fun (funvar (variable) (pat_name (constructor))) (funrhs (equals) (exp_name (variable))))
 (decl_fun
  (funvar (variable)
   (pat_parens (pat_apply (pat_name (constructor)) (pat_name (variable)))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: consym
=================================================

a (a :++ a) = a

---

(module
 (decl_fun
  (funvar
   (variable)
   (pat_parens (pat_infix (pat_name (variable)) (consym) (pat_name (variable)))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: as
=================================================

a a@(A a) a@(A a) = a

---

(module
 (decl_fun
  (funvar
   (variable)
   (pat_as (variable) (as_pat) (pat_parens (pat_apply (pat_name (constructor)) (pat_name (variable)))))
   (pat_as (variable) (as_pat) (pat_parens (pat_apply (pat_name (constructor)) (pat_name (variable))))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: wildcard
=================================================

a (A _) _ = a

---

(module
 (decl_fun
  (funvar
   (variable)
   (pat_parens (pat_apply (pat_name (constructor)) (pat_wildcard)))
   (pat_wildcard))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: literal
=================================================

a 1 2 = 3
a "a" "a" = a
a 'a' 'b' = a
a 1.0 2.0 = 3.0

---

(module
 (decl_fun (funvar (variable) (pat_literal (integer)) (pat_literal (integer))) (funrhs (equals) (exp_literal (integer))))
 (decl_fun (funvar (variable) (pat_literal (string)) (pat_literal (string))) (funrhs (equals) (exp_name (variable))))
 (decl_fun (funvar (variable) (pat_literal (char)) (pat_literal (char))) (funrhs (equals) (exp_name (variable))))
 (decl_fun (funvar (variable) (pat_literal (float)) (pat_literal (float))) (funrhs (equals) (exp_literal (float)))))

=================================================
pat: record
=================================================

f A {} = a
f A {..} = a
f a@A { a = a, b = a, a, .. } = a

---

(module
 (decl_fun (funvar (variable) (pat_name (constructor)) (pat_record)) (funrhs (equals) (exp_name (variable))))
 (decl_fun
  (funvar
   (variable)
   (pat_name (constructor))
   (pat_record (fpat (wildcard)))) (funrhs (equals) (exp_name (variable))))
 (decl_fun
  (funvar
   (variable)
   (pat_as
    (variable)
    (as_pat)
    (pat_name (constructor))
    (pat_record
     (fpat (variable) (equals) (pat_name (variable)))
     (comma)
     (fpat (variable) (equals) (pat_name (variable)))
     (comma)
     (fpat (variable)) (comma) (fpat (wildcard)))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: irrefutable
=================================================

a ~a = a
a ~(~a) = a
a ~(~(a, a), a) = a

---

(module
 (decl_fun
  (funvar (variable) (pat_irrefutable (pat_name (variable)))) (funrhs (equals) (exp_name (variable))))
 (decl_fun
  (funvar (variable) (pat_irrefutable (pat_parens (pat_irrefutable (pat_name (variable))))))
  (funrhs (equals) (exp_name (variable))))
 (decl_fun
  (funvar
   (variable)
   (pat_irrefutable
    (pat_tuple
     (pat_irrefutable (pat_tuple (pat_name (variable)) (comma) (pat_name (variable))))
     (comma)
     (pat_name (variable)))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: view pattern in funvar
=================================================

a (a a -> Aa a a) = a
a (a -> a, a -> a) = a

---

(module
 (decl_fun
  (funvar (variable)
   (pat_parens
    (pat_view
     (exp_apply (exp_name (variable)) (exp_name (variable)))
     (pat_apply (pat_name (constructor)) (pat_name (variable)) (pat_name (variable))))))
  (funrhs (equals) (exp_name (variable))))
  (decl_fun
   (funvar (variable)
    (pat_tuple
     (pat_view (exp_name (variable)) (pat_name (variable)))
     (comma)
     (pat_view (exp_name (variable)) (pat_name (variable)))))
   (funrhs (equals) (exp_name (variable)))))

=================================================
pat: view pattern in lambda
=================================================

a = \ (a -> a) -> a

---

(module
 (decl_fun
  (funvar (variable))
  (funrhs
   (equals)
   (exp_lambda
    (lambda)
    (pat_parens (pat_view (exp_name (variable)) (pat_name (variable))))
    (exp_name (variable))))))

=================================================
pat: annotation
=================================================

a (a :: A a) = a

---

(module
 (decl_fun
  (funvar
   (variable)
   (pat_parens (pat_name (variable)) (annotation) (type_apply (type_name (type)) (type_name (type_variable)))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: infix pattern in decl lhs
=================================================

A a == A a = a == a

---

(module
 (decl_fun
  (funpat
   (infix
    lhs: (pat_apply (pat_name (constructor)) (pat_name (variable)))
    op: (varop (operator))
    rhs: (pat_apply (pat_name (constructor)) (pat_name (variable)))))
  (funrhs
   (equals)
   (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable))))))

=================================================
pat: infix pattern variable
=================================================

a |> a = a

---

(module
 (decl_fun
  (funpat (infix (pat_name (variable)) (varop (operator)) (pat_name (variable))))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: tuple funpat
=================================================

(a, a) = a

---

(module (decl_fun (funpat (pat_tuple (pat_name (variable)) (comma) (pat_name (variable)))) (funrhs (equals) (exp_name (variable)))))

=================================================
pat: con application funpat
=================================================

A a = a

---

(module (decl_fun (funpat (pat_apply (pat_name (constructor)) (pat_name (variable)))) (funrhs (equals) (exp_name (variable)))))

=================================================
pat: parens con application funpat
=================================================

(A a) = a

---

(module
 (decl_fun
  (funpat (pat_parens (pat_apply (pat_name (constructor)) (pat_name (variable)))))
  (funrhs (equals) (exp_name (variable)))))

=========================================
pat: parenthesized record
=========================================

a (A{}) = a


---

(module
 (decl_fun
  (funvar (variable) (pat_parens (pat_name (constructor)) (pat_record)))
  (funrhs (equals) (exp_name (variable)))))

=================================================
pat: guards
=================================================

a a | a < 1, a > 1 = A
    | A (A A {..} _) : a <- a = A
    | otherwise = A

---

(module
 (decl_fun
  (funvar name: (variable) (pat_name (variable)))
  (funrhs
   (gdrhs
    (guards
     (guard (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_literal (integer))))
     (comma)
     (guard (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_literal (integer)))))
    (equals)
    (exp_name (constructor)))
   (gdrhs
    (guards
     (guard
      (pattern_guard
       (pat_infix
        (pat_apply
         (pat_name (constructor))
         (pat_parens
          (pat_apply (pat_name (constructor)) (pat_name (constructor)) (pat_record (fpat (wildcard))) (pat_wildcard))))
        (consym)
        (pat_name (variable)))
       (larrow)
       (exp_name (variable)))))
    (equals)
    (exp_name (constructor)))
    (gdrhs
    (guards (guard (exp_name (variable))))
    (equals)
    (exp_name (constructor))))))
