=========================================
type decl: basic
=========================================

type A = A
type A a = A a
type A = A A

---

(module
 (type_alias
  (type)
  (equals)
  (type_name (type)))
 (type_alias
  (type)
  (tyvar)
  (equals)
  (type_apply (type_name (type)) (type_name (tyvar))))
 (type_alias
  (type)
  (equals)
  (type_apply (type_name (type)) (type_name (type)))))

=========================================
type decl: two tycons
=========================================

type A = A A

---

(module (type_alias (type) (equals) (type_apply (type_name (type)) (type_name (type)))))

=========================================
type decl: promoted constructor
=========================================

type A = ' A
type A = 'A

---

(module
 (type_alias
  (type)
  (equals)
  (type_name (promoted (type))))
 (type_alias
  (type)
  (equals)
  (type_name (promoted (type)))))

=========================================
type decl: list plain
=========================================

type A = []
type A = [A a]

---

(module
 (type_alias
  (type)
  (equals)
  (type_literal (con_list)))
 (type_alias
  (type)
  (equals)
  (list_type (type_apply (type_name (type)) (type_name (tyvar))))))

=========================================
type decl: parens
=========================================

type A = ()
type A = (,)
type A = (,,)
type A = (->)

---

(module
 (type_alias
  (type)
  (equals)
  (type_literal (con_unit)))
 (type_alias
  (type)
  (equals)
  (type_literal (con_tuple (comma))))
 (type_alias
  (type)
  (equals)
  (type_literal (con_tuple (comma) (comma))))
 (type_alias
  (type)
  (equals)
  (type_name (tycon_arrow))))

=========================================
type decl: consym
=========================================

type A = A :++ A ':++ A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (type_operator))
   (type_infix
    (type_name (type))
    (tyconop (promoted (type_operator)))
    (type_name (type))))))

=========================================
type decl: list cons
=========================================

type A = A : A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (type_operator))
   (type_name (type)))))

=========================================
type decl: promoted list cons
=========================================

type A = A ': A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (promoted (type_operator)))
   (type_name (type)))))

=========================================
type decl: promoted list nil
=========================================

type A = '[]

---

(module (type_alias (type) (equals) (promoted (type_literal (con_list)))))

=========================================
type decl: qualified consym
=========================================

type A = A A.A.:++ A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (qualified_type_operator (modid (constructor)) (modid (constructor)) (type_operator)))
   (type_name (type)))))

=========================================
type decl: promoted consym
=========================================

type A = A ':++ A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (promoted (type_operator)))
   (type_name (type)))))

=========================================
type decl: qualified promoted consym
=========================================

type A = A 'A.:++ A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (promoted (qualified_type_operator (modid (constructor)) (type_operator))))
   (type_name (type)))))

=========================================
type decl: qualified ticked
=========================================

type A = A `A.A` A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (ticked (qualified_type (modid (constructor)) (type))))
   (type_name (type)))))

=========================================
type decl: promoted tuple
=========================================

type A = '(A a, A)

---

(module
 (type_alias
  (type)
  (equals)
  (promoted
   (tuple_type
    (type_apply (type_name (type)) (type_name (tyvar)))
    (comma)
    (type_name (type))))))

=========================================
type decl: equality
=========================================

type A = A ~ A
type A = A ~~ A
type A = ∀ a . (A a ~ A a) => A

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix (type_name (type)) (tyconop (type_operator)) (type_name (type))))
 (type_alias
  (type)
  (equals)
  (type_infix (type_name (type)) (tyconop (type_operator)) (type_name (type))))
 (type_alias
  (type)
  (equals)
  (forall
   (quantifiers (tyvar))
   (forall_dot)
   (context
    (constraint
     (type_infix
      (type_apply (type_name (type)) (type_name (tyvar)))
      (tyconop (type_operator))
      (type_apply (type_name (type)) (type_name (tyvar))))
    )
     (carrow)
    (type_name (type))))))

=========================================
type decl: mixed infix
=========================================

type A = A :++ A A ': A (A A a) : '[] ':++ A `A.A` '[]

---

(module
 (type_alias
  (type)
  (equals)
  (type_infix
   (type_name (type))
   (tyconop (type_operator))
   (type_infix
    (type_apply
     (type_name (type))
     (type_name (type)))
    (tyconop (promoted (type_operator)))
    (type_infix
     (type_apply
      (type_name (type))
      (type_parens (type_apply (type_name (type)) (type_name (type)) (type_name (tyvar)))))
     (tyconop (type_operator))
     (type_infix
      (promoted (type_literal (con_list)))
      (tyconop (promoted (type_operator)))
      (type_infix
       (type_name (type))
       (tyconop (ticked (qualified_type (modid (constructor)) (type))))
       (promoted (type_literal (con_list))))))))))

=========================================
type decl: symbol
=========================================

type A = "a"
type A = A (A "a")

---

(module
 (type_alias (type) (equals) (type_literal (string)))
 (type_alias
  (type)
  (equals)
  (type_apply
   (type_name (type))
   (type_parens (type_apply (type_name (type)) (type_literal (string)))))))

=========================================
type decl: prefix notation symbol
=========================================

type A = (++) a a

---

(module
 (type_alias
  (type)
  (equals)
  (type_apply
   (type_name (type_operator))
   (type_name (tyvar))
   (type_name (tyvar)))))

=========================================
type decl: nullary context
=========================================

type A = A => A

---

(module
 (type_alias
  (type)
  (equals)
  (context (constraint (class_name (type))) (carrow) (type_name (type)))))

=========================================
type decl: forall
=========================================

type A = ∀ a a . A => A
type A = forall a a . A a => [A]

---

(module
 (type_alias
  (type)
  (equals)
  (forall
   (quantifiers (tyvar) (tyvar))
   (forall_dot)
   (context (constraint (class_name (type))) (carrow) (type_name (type)))))
  (type_alias
   (type)
   (equals)
   (forall
    (quantifiers (tyvar) (tyvar))
    (forall_dot)
    (context
     (constraint (class_name (type)) (type_name (tyvar)))
     (carrow)
     (list_type (type_name (type)))))))

=========================================
type decl: lhs parens
=========================================

type (A a a) = A

---

(module (type_alias (type) (tyvar) (tyvar) (equals) (type_name (type))))
