=================================================
operator: error: |
=================================================

f = a | a

---

(module (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable))))))

=================================================
operator: error: lambda
=================================================

f = a \\ a
f = a \ a

---

(module
 (decl_fun
  (funvar (variable))
  (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
 (decl_fun
  (funvar (variable))
  (funrhs (exp_name (variable)))) (ERROR (variable)))

=================================================
operator: error: ..
=================================================

f = a .. a
f = a ... a
f = a . a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: error: _arrow
=================================================

f = a -> a
f = a |> a

---

(module
 (decl_fun
  (funvar (variable))
  (funrhs
   (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable)))))
 (decl_fun
  (funvar (variable))
  (funrhs
   (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable))))))

=================================================
operator: error: carrow
=================================================

f = a => a
f = a =>> a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: error: larrow
=================================================

f = a < a
f = a <- a
f = a <-- a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: error: @
=================================================

f = a @ a
f = a @@ a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (exp_tyapp (type_name (type_variable))))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: error: ~
=================================================

f = a ~ a
f = a ~~ a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: error: equals
=================================================

f = a = a
f = a == a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_apply (exp_name (variable)) (ERROR) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: error: leading :
=================================================

f = a :+ a
f = a +: a

---

(module
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (consym) (exp_name (variable)))))
  (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
)

=================================================
operator: dollar
=================================================

f = a $ a

---

(module (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable))))))

=================================================
operator: two-symbol dollar operator
=================================================

a = a $! a

---

(module (decl_fun (funvar (variable)) (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable))))))

=================================================
operator: comment with more than two dashes
=================================================

a --- a
a ----- a

---

(module (top_splice (exp_name (variable))) (comment) (top_splice (exp_name (variable))) (comment))

=================================================
operator: operator with large number of dashes
=================================================

a = a ------> a ----- %

---

(module
 (decl_fun
  (funvar (variable))
  (funrhs (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable)))))
 (comment))

=================================================
operator: implicit parameter
=================================================

a = ?a
(?) = a
a = a ? a

---

(module
 (decl_fun
  (funvar (variable))
  (funrhs (exp_name (implicit_parid))))
 (decl_fun
  (funvar (operator))
  (funrhs (exp_name (variable))))
 (decl_fun
  (funvar (variable))
  (funrhs
   (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_name (variable))))))

=================================================
operator: dollar terminated by opening bracket
=================================================

a = a $[a]

---

(module
 (decl_fun
  (funvar (variable))
  (funrhs
   (exp_infix (exp_name (variable)) (qvarop (operator)) (exp_list (exp_name (variable)))))))

=================================================
operator: bang as operator decl
=================================================

(!) :: A
(!) = a

---

(module
 (signature (operator) (type_name (type)))
 (decl_fun (funvar (operator)) (funrhs (exp_name (variable)))))
